Revit 2027 API
FabricationPart.GetAirturnInfo Method
 Gets the air turn information for the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetAirturnInfo(
	int index,
	out bool locked
)
Public Function GetAirturnInfo (
	index As Integer,
	<OutAttribute> ByRef locked As Boolean
) As Integer
public:
int GetAirturnInfo(
	int index,
	[OutAttribute] bool% locked
)
member GetAirturnInfo :
        index : int *
        locked : bool byref -> int
Parameters
index Int32
 The index of the air turn to get.
locked Boolean
 The locked status to be returned.
Return Value
Int32
 Returns the database identifier of the air turn.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The air turn index is out of valid range.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace